In [1]:
import pandas as pd

# 5. DataFrame by using the Csv file

In [5]:
df_exams = pd.read_csv('mycsvfile.csv')

In [6]:
# shows first 5 rows of the dataframe
df_exams.head()

      Name  age classs grade gender
0   shivam    3   12th     a      f
1    rohit    2    8th     b      m
2   chetan   12    6th     c      m
3  asshish   32    9th     b      m
4    mohit   12   10th     d      m

In [7]:
df_exams

      Name  age classs grade gender
0   shivam    3   12th     a      f
1    rohit    2    8th     b      m
2   chetan   12    6th     c      m
3  asshish   32    9th     b      m
4    mohit   12   10th     d      m
5  asshmit   12    4th     e      m